renesas/rx-driver-package/source/r_sdhi_rx/r_sdhi_rx_vx.xx/r_sdhi_rx/src/targets/rx66n/r_sdhi_dev.c
        if (select & SDHI_HWINT_ACCESS_CD)
        {
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif
            ICU.GENBL1.BIT.EN3 = 0;
            ICU.GENBL1.BIT.EN4 = 0;
            ICU.GENBL1.BIT.EN5 = 0;
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif
            if (0 == ICU.GENBL1.BIT.EN5)
            {
                R_BSP_NOP();    /* Wait for the write completion. */
            }

            ipl = 0;
            R_BSP_InterruptControl(BSP_INT_SRC_BL1_SDHI_CDETI,
                                   BSP_INT_CMD_GROUP_INTERRUPT_DISABLE,
                                   (void *)&ipl);
        }

        if (select & SDHI_HWINT_BUFFER)
        {
            IPR(SDHI,SBFAI)    = 0;
            if (0 == IPR(SDHI,SBFAI))
            {
                R_BSP_NOP();    /* Wait for the write completion. */
            }
        }
    }

    return SDHI_SUCCESS;

} /* End of function R_SDHI_DisableIcuInt() */

/**********************************************************************************************************************
 * Function Name: R_SDHI_EnableIcuInt
 *****************************************************************************************************************/ /**
 * @brief Enables ICU controller interrupts for the SDHI.\n 
 *        note : The following interrupt is enabled. [SD buffer access interrupt (SBFAI), 
 *        Card detect interrupt (CDETI), Card access interrupt (CACI), SDIO access interrupt (SDACI)]
 * @param[in] channel
 *             Channel number : SDHI channel number to be used (starting from 0)
 * @param[in] select
 *             Specify interrupt arguments. See section 3.7 in application note for details.
 * @retval    SDHI_SUCCESS Successful operation
 * @retval    SDHI_ERR     General error
 * @details   Makes settings to the ICU controller registers. \n 
 *            Makes settings to the SDHI's interrupt source property register (IPR). The setting values are defined by
 *            #define SDHI_CHx_INT_LEVRL and #define SDHI_CFG_CHx_INT_LEVEL_DMADTC.\n 
 *            Sets the SDHI interrupt request enable register (IEN) to enable interrupts.
 * @note      Before running this function, initialization processing by the R_SDHI_Open() function is required.
 */
sdhi_status_t R_SDHI_EnableIcuInt(uint32_t channel, uint32_t select)
{
    uint32_t ipl = 0;
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
#endif

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    sdhi_sdhndl_t * p_hndl = 0;

    if ((uint32_t)((sizeof(g_sdhi_ip_base)) / sizeof(uint32_t)) <= channel)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_DEV, __LINE__);
        return SDHI_ERR;
    }

    p_hndl = SDHI_GET_HNDL(channel);
    if (0 == p_hndl)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_DEV, __LINE__);
        return SDHI_ERR;  /* not initialized */
    }

    if (select & SDHI_HWINT_PARAM)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_DEV, __LINE__);
        return SDHI_ERR;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    if (SDHI_CH0 == channel)    /* SDHI_CH0 */
    {
        /* ---- Enable interrupt request (IENn) of IER. ---- */
        if (select & SDHI_HWINT_BUFFER)
        {
            IPR(SDHI,SBFAI)    = SDHI_CFG_CH0_INT_LEVEL_DMADTC;
        }

        if (select & SDHI_HWINT_ACCESS_CD)
        {
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif
            ICU.GENBL1.BIT.EN3 = 1;
            ICU.GENBL1.BIT.EN4 = 1;
            ICU.GENBL1.BIT.EN5 = 1;
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif
            if (1 == ICU.GENBL1.BIT.EN5)
            {
                R_BSP_NOP();    /* Wait for the write completion. */
            }

            ipl = SDHI_CFG_CH0_INT_LEVEL;
            R_BSP_InterruptControl(BSP_INT_SRC_BL1_SDHI_CDETI,
                                   BSP_INT_CMD_GROUP_INTERRUPT_ENABLE,
                                   (void *)&ipl);
        }

        if (select & SDHI_HWINT_BUFFER)
        {
            R_BSP_InterruptRequestEnable(VECT(SDHI, SBFAI));
            if (1 == IEN(SDHI,SBFAI))
            {
                R_BSP_NOP();    /* Wait for the write completion. */
            }
        }
    }

    return SDHI_SUCCESS;

} /* End of function R_SDHI_EnableIcuInt() */

/**********************************************************************************************************************
 * Function Name: R_SDHI_CDLayout
 *****************************************************************************************************************/ /**
 * @brief This function checks whether the SDHI_CD (SD card detection) pin is used.
 * @param[in] channel
 *             Channel number : SDHI channel number to be used (starting from 0)
 * @retval    SDHI_SUCCESS CD pin used.
 * @retval    SDHI_ERR     CD pin not used.
 * @details   Checks whether the CD pin is used.
 * @note      None
 */
sdhi_status_t R_SDHI_CDLayout(uint32_t channel)
{
    sdhi_status_t ret = SDHI_ERR;

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if ((uint32_t)((sizeof(g_sdhi_ip_base)) / sizeof(uint32_t)) <= channel)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_DEV, __LINE__);
        return SDHI_ERR;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

